#Использовать v8find
ПутьКПредприятию_x86 = Платформа1С.ПутьКПредприятию("8.3");
ПутьКФайлуКонфМассив = СтрРазделить(ПутьКПредприятию_x86, "\");
ПутьКФайлуКонфМассив.Удалить(ПутьКФайлуКонфМассив.Количество() - 1);
ПутьКФайлуКонфМассив.Удалить(ПутьКФайлуКонфМассив.Количество() - 1);
ПутьКФайлуКонфМассив.Удалить(ПутьКФайлуКонфМассив.Количество() - 1);
ПутьКФайлуКонфМассив.Добавить("conf\conf.cfg");
ПутьКФайлуКонф = СтрСоединить(ПутьКФайлуКонфМассив, "\");
 
ТД = Новый ТекстовыйДОкумент();
Попытка 
	ТД.ПРочитать(ПутьКФайлуКонф);
Исключение
	Сообщить("Ошибка " + ИнформацияОбОшибке().ПодробноеОписаниеОшибки());
	ЗавершитьРаботу(5);
КонецПопытки;
ЕстьНастройки = Ложь;
Для ы = 1 по ТД.КоличествоСтрок() Цикл
	СтрокаТД = ТД.ПолучитьСтроку(ы);
	Если СтрНайти(СтрокаТД, "DisableUnsafeActionProtection") <> 0 Тогда
	 	Сообщить("Строка настроек существует");
	 	ЕстьНастройки = Истина;
	 	Прервать;
	КонецЕсли;	
КонецЦикла;

Если НЕ ЕстьНастройки Тогда
	ТД.ДобавитьСтроку("DisableUnsafeActionProtection=.*");
	
Попытка 
	ТД.Записать(ПутьКФайлуКонф);
Исключение
	Сообщить("Ошибка " + ИнформацияОбОшибке().Описание);
	ЗавершитьРаботу(5);
КонецПопытки;
Сообщить("Строка DisableUnsafeActionProtection=.* добавлена");
КонецЕсли;