#Использовать v8find
ПутьКПредприятию_x86 = Платформа1С.ПутьКПредприятию("8.3");
ПутьКФайлуКонфМассив = СтрРазделить(ПутьКПредприятию_x86, "\");
ПутьКФайлуКонфМассив.Удалить(ПутьКФайлуКонфМассив.Количество() - 1);
ПутьКФайлуКонфМассив.Удалить(ПутьКФайлуКонфМассив.Количество() - 1);
ПутьКФайлуКонфМассив.Удалить(ПутьКФайлуКонфМассив.Количество() - 1);
ПутьКФайлуКонфМассив.Добавить("conf\conf.cfg");
ПутьКФайлуКонф = СтрСоединить(ПутьКФайлуКонфМассив, "\");
 
ТД = Новый ТекстовыйДОкумент();
ТД.ПРочитать(ПутьКФайлуКонф);
Сообщить(ТД.КоличествоСтрок());
ЕстьНастройки = Ложь;
Для ы = 1 по ТД.КоличествоСтрок() Цикл
	СтрокаТД = ТД.ПолучитьСтроку(ы);
	Если СтрНайти(СтрокаТД, "DisableUnsafeActionProtection") <> 0 Тогда
	 	Сообщить("Строка настроек существует");
	 	ЕстьНастройки = Истина;
	 	Прервать;
	КонецЕсли;	
	Сообщить(СтрокаТД);
КонецЦикла;

Если НЕ ЕстьНастройки Тогда
	ТД.ДобавитьСтроку("DisableUnsafeActionProtection=.*");
	Сообщить("Строка DisableUnsafeActionProtection=.* добавлена");
КонецЕсли;
ТД.Записать(ПутьКФайлуКонф);
Сообщить(ПутьКФайлуКонф);