#Использовать v8runner

ПутьКДанным = АргументыКоманднойСтроки[0];
Сообщить(ПутьКДанным);
ЧтениеХМЛ = Новый ЧтениеXML();
ЧтениеХМЛ.ОткрытьФайл(ПутьКДанным + "\Configuration.xml");
ТЗ = Новый ТаблицаЗначений();
ТЗ.Колонки.Добавить("Строка");
ТЗ.Колонки.Добавить("Тег");
Пока ЧтениеХМЛ.Прочитать() Цикл
	Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеХМЛ.Имя = "ChildObjects" Тогда
		//Сообщить("Нашел");
		Пока ЧтениеХМЛ.Прочитать() Цикл
			Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Начало = ЧтениеХМЛ.Имя;
			ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.Текст Тогда 
				Тег = СтрШаблон("<%1>%2</%3>",Начало, ЧтениеХМЛ.Значение, Начало);
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.Строка = ЧтениеХМЛ.Значение;
				НоваяСтрока.Тег = Тег;
			КонецЕсли;
			Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеХМЛ.Имя = "ChildObjects" Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецЦикла;
ТЗ.Сортировать("Строка");
Для каждого Переменная Из ТЗ Цикл
//	Сообщить(Переменная.Тег);
КонецЦикла;
ЧтениеХМЛ.Закрыть();

Чтение = Новый ЧтениеТекста();
ЗаписьФайл = НОвый ЗаписьТекста(ПутьКДанным + "\Configuration2.xml");

Чтение.Открыть(ПутьКДанным + "\Configuration.xml");
СтрокаТекста = Чтение.ПрочитатьСтроку();
Пока СтрокаТекста <> Неопределено Цикл
Если СокрЛП(СтрокаТекста) <> "<ChildObjects>" Тогда
	ЗаписьФайл.ЗаписатьСтроку(СтрокаТекста);
	Сообщить(СтрокаТекста);
Иначе
	СтрокаТекста = Чтение.ПрочитатьСтроку();
	Пока СтрокаТекста <> Неопределено Цикл
		Если СокрЛП(СтрокаТекста) = "</ChildObjects>" Тогда

			ЗаписьФайл.ЗаписатьСтроку("<ChildObjects>");
			Для каждого Переменная Из ТЗ Цикл
					ЗаписьФайл.ЗаписатьСтроку(Переменная.Тег);
			КонецЦикла;
			ЗаписьФайл.ЗаписатьСтроку("</ChildObjects>");

			Прервать;
		КонецЕсли;
	СтрокаТекста = Чтение.ПрочитатьСтроку();
	КонецЦикла;
КонецЕсли;
СтрокаТекста = Чтение.ПрочитатьСтроку();
КонецЦикла;
Чтение.Закрыть();
ЗаписьФайл.Закрыть();

// Переименуем файлы
ПереместитьФайл(ПутьКДанным + "\Configuration.xml", ПутьКДанным + "\Configuration3.xml");
ПереместитьФайл(ПутьКДанным + "\Configuration2.xml", ПутьКДанным + "\Configuration.xml");
ПереместитьФайл(ПутьКДанным + "\Configuration3.xml", ПутьКДанным + "\Configuration2.xml");

УправлениеКонфигуратором = Новый УправлениеКонфигуратором();
ПараметрыЗапуска = УправлениеКонфигуратором.ПолучитьПараметрыЗапуска();
ПараметрыЗапуска.Добавить("/ManageCfgSupport -disableSupport -force");
Попытка
	УправлениеКонфигуратором.ВыполнитьКоманду(ПараметрыЗапуска);
Исключение
	// вывод log-файла с сообщениями от платформы.
	Сообщить(УправлениеКонфигуратором.ВыводКоманды());
КонецПопытки;
ПараметрыЗапуска = УправлениеКонфигуратором.ПолучитьПараметрыЗапуска();
ПараметрыЗапуска.Добавить(СтрШаблон("/LoadConfigFromFiles ""%1""", ПутьКДанным));
Попытка
	УправлениеКонфигуратором.ВыполнитьКоманду(ПараметрыЗапуска);
Исключение
	// вывод log-файла с сообщениями от платформы.
	Сообщить(УправлениеКонфигуратором.ВыводКоманды());
КонецПопытки;

ПараметрыЗапуска = УправлениеКонфигуратором.ПолучитьПараметрыЗапуска();
ПараметрыЗапуска.Добавить("/UpdateDBCfg");
Попытка
	УправлениеКонфигуратором.ВыполнитьКоманду(ПараметрыЗапуска);
Исключение
	// вывод log-файла с сообщениями от платформы.
	Сообщить(УправлениеКонфигуратором.ВыводКоманды());
КонецПопытки;
ПараметрыЗапуска = УправлениеКонфигуратором.ПолучитьПараметрыЗапуска();
ПараметрыЗапуска.Добавить("/DumpDBCfg ""1.cf""");
Попытка
	УправлениеКонфигуратором.ВыполнитьКоманду(ПараметрыЗапуска);
Исключение
	// вывод log-файла с сообщениями от платформы.
	Сообщить(УправлениеКонфигуратором.ВыводКоманды());
КонецПопытки;

УдалитьФайлы("v8r_TempDB");

УдалитьФайлы(ПутьКДанным + "\Configuration.xml");

ПереместитьФайл(ПутьКДанным + "\Configuration2.xml", ПутьКДанным + "\Configuration.xml");